### Terraform Plan Report
* [ ] Terraform Format and Style: `success`
* [ ] Terraform Initialization: `success`
* [ ] Terraform Validation: `success`
* [ ] Terraform Plan: `success`

```hcl
module.service_principal.data.azuread_client_config.this: Reading...
module.service_principal.data.azuread_client_config.this: Read complete after 0s [id=5e0527d0-b0a8-46e9-b753-db3f51fb4dc2-2195d5be-dea4-43da-b80f-def3c78d165f-e5276b77-8439-478f-87f5-0e65830fe489]
module.role_assignment_on_service_principal.data.azurerm_role_definition.roles["Contributor"]: Reading...
module.role_assignment_on_service_principal.data.azurerm_role_definition.roles["User Access Administrator"]: Reading...
module.role_assignment_on_service_principal.data.azurerm_role_definition.roles["Contributor"]: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c]
module.role_assignment_on_service_principal.data.azurerm_role_definition.roles["User Access Administrator"]: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "koreacentral"
      + name     = "eunsang-iac"
    }

  # azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "example-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "eunsang-iac"
      + virtual_network_name                          = "example-vnet"
    }

  # azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "koreacentral"
      + name                           = "example-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "eunsang-iac"
      + subnet                         = (known after apply)
    }

  # module.managed_identity_system_assigned.azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "koreacentral"
      + name                = "example-managed-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "eunsang-iac"
      + tenant_id           = (known after apply)
    }

  # module.managed_identity_user_assigned.azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "koreacentral"
      + name                = "example-managed-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "eunsang-iac"
      + tenant_id           = (known after apply)
    }

  # module.role_assignment_on_service_principal.azurerm_role_assignment.this["Contributor"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c"
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.role_assignment_on_service_principal.azurerm_role_assignment.this["User Access Administrator"] will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = "/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9"
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.service_principal.azuread_application.this will be created
  + resource "azuread_application" "this" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "myApp"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "e5276b77-8439-478f-87f5-0e65830fe489",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)
    }

  # module.service_principal.azuread_service_principal.this will be created
  + resource "azuread_service_principal" "this" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_tenant_id        = (known after apply)
      + client_id                    = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + owners                       = [
          + "e5276b77-8439-478f-87f5-0e65830fe489",
        ]
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)
    }

  # module.user.azuread_user.this will be created
  + resource "azuread_user" "this" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + creation_type                  = (known after apply)
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "John Doe"
      + external_user_state            = (known after apply)
      + force_password_change          = true
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "johndoe"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "john.doe@contoso.com"
      + user_type                      = (known after apply)
    }

  # module.virtual_machine_with_system_assigned_managed_identity.azurerm_linux_virtual_machine.this will be created
  + resource "azurerm_linux_virtual_machine" "this" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "koreacentral"
      + max_bid_price                                          = -1
      + name                                                   = "example-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "eunsang-iac"
      + size                                                   = "Standard_DS1_v2"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 30
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # module.virtual_machine_with_system_assigned_managed_identity.azurerm_network_interface.this will be created
  + resource "azurerm_network_interface" "this" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "koreacentral"
      + mac_address                    = (known after apply)
      + name                           = "example-vm-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "eunsang-iac"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

*Pusher: @Kyrsang, Workflow: `Terraform on Comment`*